import { Injectable } from "@angular/core";
import { AboutModel } from "../models/about.model";

@Injectable()
export class AboutService {

    private data: AboutModel = {
        goals: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        properties: [
            {
                img: "",
                title: "لورم ایپسوم1",
                desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است"
            },
            {
                img: "",
                title: "لورم ایپسوم2",
                desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است"
            },
            {
                img: "",
                title: "لورم ایپسوم3",
                desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است"
            },
        ],
        team: [
            {
                img: "/assets/images/team-1.png",
                name: "عارف حسین پور",
                desc: "بنیانگذار و سئو کار هفده"
            },
            {
                img: "/assets/images/team-2.png",
                name: "فرشید وثوق",
                desc: "توسعه دهنده فرانت-اند، هم بنیان گذار هفده و آچار فرانسه تیم"
            },
            {
                img: "/assets/images/team-3.png",
                name: "محمد زاهدی",
                desc: "توسعه دهنده بک-اند و اسکرام مستر بی اعصاب و خسته تیم"
            },
            {
                img: "/assets/images/team-4.png",
                name: "رکسانا احمدی",
                desc: "طراح حرفه ای رابط کاربری، گرافیست خوش ذوق و نویسنده خلاق"
            }
        ]
    }

    getAllData = (): AboutModel => {
        return this.data;
    }

    getTeamMember = () => {

    }
}